{
    "version": "https://jsonfeed.org/version/1",
    "title": "1337core Blog",
    "description": "",
    "home_page_url": "https://www.1337core.de/blog",
    "feed_url": "https://www.1337core.de/blog/feed.json",
    "user_comment": "",
    "author": {
        "name": "Leetcore"
    },
    "items": [
        {
            "id": "https://www.1337core.de/blog/passwortleaks-der-top-100-unternehmen-in-deutschland.html",
            "url": "https://www.1337core.de/blog/passwortleaks-der-top-100-unternehmen-in-deutschland.html",
            "title": "Passwortleaks der Top 100 Unternehmen in Deutschland!",
            "summary": "Ich dachte das Projekt wird super easy. Die entsprechenden öffentlichen Passwortleaks sind leicht zu finden und im Prinzip muss ich die nur durchsuchen und daraus eine Statistik machen. Das Problem war aber, dass es einfach echt dauert 110GB effizient zu durchsuchen. Der Leak ist im Format: \"email:password\". Nach etwas Rechenzeit und viele kleine Pythonscripte später hatte ich endlich ein paar Statistiken zur Hand. Der erste Schritt war der einfachste: Ich schrieb ein Script für Wikipedia, um sich dort die Domains der 100 größten Unternehmen in Deutschland zu ziehen. Damit hatte ich schon mal den Domainteil der E-Mailadresse a la @unternehmen.de&hellip;",
            "content_html": "\n  <p>\n    Ich dachte das Projekt wird super easy. Die entsprechenden<br>                öffentlichen Passwortleaks sind leicht zu finden und im Prinzip<br>                muss ich die nur durchsuchen und daraus eine Statistik machen.\n  </p>\n\n  <p>\n    Das Problem war aber, dass es einfach echt dauert 110GB<br>                effizient zu durchsuchen. Der Leak ist im Format:<br>                \"email:password\". Nach etwas Rechenzeit und viele kleine<br>                Pythonscripte später hatte ich endlich ein paar Statistiken<br>                zur Hand.\n  </p>\n\n    <h2 id=\"der-plan\">\n      Der Plan\n    </h2>\n\n  <ul>\n    <li>100 Domains der Top-Unternehmen</li><li>Passwortleak<br></li><li>Auswertung der Leaks<br></li>\n  </ul>\n\n    <h2 id=\"vorbereitung\">\n      Vorbereitung\n    </h2>\n\n  <p>\n    Der erste Schritt war der einfachste: Ich schrieb ein Script<br>                für Wikipedia, um sich dort die Domains der 100 größten Unternehmen in Deutschland zu ziehen. Damit hatte ich schon mal den Domainteil der<br>                E-Mailadresse a la @unternehmen.de\n  </p>\n\n  <p>\n    Das Problem ist die große Datenmenge und eben die 100<br>                Domains. Das würde bedeuten, dass ich 100 mal die ganzen<br>                Datenmenge durchsuchen muss. Meine Laune hält sich in Grenzen\n  </p>\n\n  <p>\n    Deshalb war es meine Idee, dass in einer Regex für 20 Domains<br>                in einem Durchgang zu machen. Der Versuch direkt alle zu<br>                machen ist gescheitert. Aber immerhin muss ich dann nur 5 mal<br>                über die komplette Datei. Also baute ich mir ein Script, was<br>                mir die Regex baut, die dann per grep alle Leaks nur von diesen<br>                Unternehmen filtert. Das macht die Auswertung dann<br>                auch deutlich schneller!\n  </p>\n\n  <p>\n    Am Ende kommt eine kleinere Datei mit E-Mails und<br>                Passwörtern heraus, die ich durchsuchen kann.\n  </p>\n\n    <h2 id=\"unternehmen\">\n      Unternehmen\n    </h2>\n\n  <p>\n    Airbus, Volkswagen, Mercedes Benz, BMW, Deutsche Bahn, Bosch, Siemens, Telekom<br>                und alle weiteren aus <a href=\"https://de.wikipedia.org/wiki/Liste_der_größten_Unternehmen_in_Deutschland_(Wertschöpfung)\" target=\"_blank\">dieser Liste</a>.\n  </p>\n\n  <p>\n    Es wurden 307.530 Passwörter dieser Unternehmen untersucht.\n  </p>\n\n    <h2 id=\"aufbau\">\n      Aufbau\n    </h2>\n\n  <p>\n    Liste der Top-Unternehmen von Wikipedia. Filter eines<br>großen Passwortleaks nach Domain. Zum Beispiel \"@siemens.com\", danach<br>                zähle ich die beliebtesten Passwörter und erstelle eine Statistik<br>                über die Zeichenlänge und Komplexität.\n  </p>\n\n    <h2 id=\"ergebnisse\">\n      Ergebnisse\n    </h2>\n\n  <p>\n    Auf Platz 1 ist natürlich 123456, wie auch bei den meisten Listen über bekannte<br>                Passwörter. Danach wird es interessiert: Erstaunlich oft wird der Firmenname<br>                oder die Domain der Firma verwendet. Die komplexeren Passwörter bestehen oft<br>                aus einem Ort und einer Jahreszahl mit Sonderzeichen.\n  </p>\n\n    <h2 id=\"beliebte-passwoerter\">\n      Beliebte Passwörter\n    </h2>\n\n  <p>\n    1. 123456 (1085 Passwörter)<br>2. password (794 Passwörter)<br>3. Exigent (777 Passwörter)<br>4. passport (683 Passwörter)<br>5. 12345678 (656 Passwörter)<br>6. ********* (Projektname mit 443 am Ende) (582 Passwörter)<br>7. ********* (Firmendomain.com) (484 Passwörter)<br>8. dttesc (455 Passwörter)<br>9. aaron431 (356 Passwörter)<br>10. ********* (Firmendomain.com) (324 Passwörter)<br>11. ********* (Firmendomain.com) (318 Passwörter)<br>12. linkedin (283 Passwörter)<br>13. ********* (Firmenname) (280 Passwörter)<br>            14. ********* (Firmenname) (190 Passwörter)<br>            15. ********* (Firmendomain.com) (183 Passwörter)\n  </p>\n\n  <p>\n    &nbsp;Passwörter die ********* enthalten, musste ich zensieren, weil sich daraus<br>                direkt auf ein Unternehmen schließen lässt.\n  </p>\n\n    <h2 id=\"komplexitaet\">\n      Komplexität\n    </h2>\n\n  <p>\n    Damit ich nicht einzelne Passwörter veröffentliche, zeige ich hier<br>                nur die Muster der \"besten\" Passwörter in der Liste. In eckigen Klammern steht der ersetzte Begriff.\n  </p>\n\n  <p>\n    1. Climbinging[ORT]2015<br>2. !!!![BLUME]2008!!!<br>3. [ORT]2015!1995<br>4. Ontherocks[ZAHL][SONDERZEICHEN]<br>5. [ORT]2016!!!<br>6. Pistol[NAME][ZAHL]][SONDERZEICHEN]<br>            7. [NAME]]20rlovely_babes[ZAHL]<br>            8. [PFLANZE]123!<br>            9. [FIRMENNAME][ZAHL]_[WEBSEITE]<br>10. [PFLANZE]1!<br>\n  </p>\n\n    <h2 id=\"weitere-passwoerter\">\n      Weitere Passwörter\n    </h2>\n\n  <p>\n    Password (109 Passwörter)<br>111111 (105 Passwörter)<br>adv24 (103 Passwörter)<br>research (96 Passwörter)<br>demo (94 Passwörter)<br>Password1 (89 Passwörter)<br>snowman (89 Passwörter)<br>sunshine (75 Passwörter)<br>password1 (72 Passwörter)<br>welcome1 (66 Passwörter)<br>daniel (52 Passwörter)<br>michelle (51 Passwörter)<br>abc123 (51 Passwörter)<br>michael (49 Passwörter)<br>654321 (47 Passwörter)<br>letmein (44 Passwörter)<br>london (42 Passwörter)<br>summer (41 Passwörter)\n  </p>\n\n    <h2 id=\"fazit\">\n      Fazit\n    </h2>\n\n  <p>\n    Das Ergebnis ist etwas überrachend, weil die Mitarbeiter/-innen <br>                vor allem den eigenen Firmennamen als Passwort verwendent. In <br>                den größeren Listen sind eher allgemeine Passwörter zu finden. <br>                Hier wird es dem Angreifer sogar noch einfacher gemacht, weil <br>                er direkt von der E-Mailadresse auf das Passwort schließen kann.\n  </p>\n\n  <p>\n    Archivpost vom 26.07.2022.\n  </p>\n\n  <p>\n    \n  </p>",
            "author": {
                "name": "Leetcore"
            },
            "tags": [
            ],
            "date_published": "2025-09-14T21:15:14+02:00",
            "date_modified": "2026-02-11T07:27:18+01:00"
        },
        {
            "id": "https://www.1337core.de/blog/ninja-hacker-cat-fuer-firefox.html",
            "url": "https://www.1337core.de/blog/ninja-hacker-cat-fuer-firefox.html",
            "title": "Ninja Hacker Cat für Firefox",
            "summary": "Das ist ein Archivpost vom 15.10.2022. Das Projekt wird von mir nicht weiterentwickelt. Projekte, Projekte, Projekte. Diese Idee war erstaunlich gut: Wie kann man Webseiten auf Sicherheitslücken testen und das für viele Menschen einfacher machen? Mit einer Browser-Erweiterung: Eine Browser-Erweiterung, die automatisch verschiedene Tests durchführt. Also den Twitch-Stream angeworfen und den hübschesten Texteditor aller Zeiten gestartet. Ja, ich habe jetzt auch eine Katze in meinem Code-Editor. Weil... KATZE! Einfache Sicherheitslücken, lassen sich relativ gut automatisch erkennen. Das bringe ich meiner Hacker-Katze nun bei. Wenn sich die Version der Web Anwendung herausfinden lässt, kann ich auch anhand der Version vor Lücken&hellip;",
            "content_html": "\n  <p>\n    Das ist ein Archivpost vom 15.10.2022. Das Projekt wird von mir nicht weiterentwickelt.\n  </p>\n\n  <p>\n    Projekte, Projekte, Projekte. Diese Idee war erstaunlich gut: <br>                Wie kann man Webseiten auf Sicherheitslücken testen und das für <br>                viele Menschen einfacher machen? Mit einer Browser-Erweiterung:<br>                Eine Browser-Erweiterung, die automatisch verschiedene Tests <br>                durchführt. Also den Twitch-Stream angeworfen und den hübschesten <br>                Texteditor aller Zeiten gestartet. Ja, ich habe jetzt auch eine <br>                Katze in meinem Code-Editor. Weil... KATZE!\n  </p>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://www.1337core.de/blog/media/posts/2/NinjaHackerCat-3.png\" height=\"476\" width=\"797\" alt=\"\"  sizes=\"(min-width: 920px) 703px, (min-width: 700px) calc(82vw - 35px), calc(100vw - 81px)\" srcset=\"https://www.1337core.de/blog/media/posts/2/responsive/NinjaHackerCat-3-xs.png 300w ,https://www.1337core.de/blog/media/posts/2/responsive/NinjaHackerCat-3-sm.png 480w ,https://www.1337core.de/blog/media/posts/2/responsive/NinjaHackerCat-3-md.png 768w ,https://www.1337core.de/blog/media/posts/2/responsive/NinjaHackerCat-3-lg.png 1024w\">\n      <figcaption>Ninja Hacker Cat in Action</figcaption>\n    </figure>\n\n  <p>\n    Einfache Sicherheitslücken, lassen sich relativ gut automatisch <br>                erkennen. Das bringe ich meiner Hacker-Katze nun bei. Wenn sich <br>                die Version der Web Anwendung herausfinden lässt, kann ich auch <br>                anhand der Version vor Lücken warnen. Dazu überprüft die Katze <br>                die Version oder macht direkt das Proof of Concept.\n  </p>\n\n  <p>\n    Der Fokus liegt (wie immer) auf kritischen Sicherheitslücken. <br>                Alles was bekannt ist und aktiv ausgenutzt wird. Alle Lücken, <br>                die auch für Massenhacks in Frage kommen.<br>\n  </p>\n\n  <p>\n    Ich wollte etwas bauen, was einfach zu bedienen ist und nicht <br>                abhängig von irgendeinem Dienst (wobei sich das optional noch <br>                erweitern lässt). Dinge, wie Proxyshell, die kritische Lücke <br>                in den Microsoft Exchange Servern. Die lässt sich damit <br>                erkennen, wenn man mit der Erweiterung auf die Weboberfläche geht.\n  </p>\n\n  <p>\n    <a href=\"https://github.com/Leetcore/ninja-hacker-cat\" target=\"_blank\">https://github.com/Leetcore/ninja-hacker-cat</a><br><a href=\"https://addons.mozilla.org/en-US/firefox/addon/ninja-hacker-cat/\" target=\"_blank\">https://addons.mozilla.org/en-US/firefox/addon/ninja-hacker-cat/</a><br>\n  </p>",
            "author": {
                "name": "Leetcore"
            },
            "tags": [
            ],
            "date_published": "2025-09-14T20:46:53+02:00",
            "date_modified": "2026-02-11T07:28:18+01:00"
        },
        {
            "id": "https://www.1337core.de/blog/hello-world.html",
            "url": "https://www.1337core.de/blog/hello-world.html",
            "title": "Hello World",
            "summary": "Oh nein, es ist wieder soweit. Ich habe einen Blog angefangen. Ihr(TM) wisst sicherlich noch - damals - als ich 2008 diesen Security Blog hatte. Das war irgendwann durch (damals) Twitter nicht mehr notwendig, weil der Austausch sowieso schneller ging und irgendwann niemand mehr RSS-Reader hatte. Danke Google fürs Abschalten von Google Reader, du Arsch! Da Twitter nun durch Mastodon ersetzt wurde, funktioniert das mit dem schnelleren Austausch immer noch ganz gut, aber da haben wir das 500 Zeichen Limit. Ordentliche Tutorials lassen sich damit nicht schreiben. Einige Jahre tat sich auch nichts Wildes im Bereich Technologie, sodass es sich&hellip;",
            "content_html": "\n  <p>\n    Oh nein, es ist wieder soweit. Ich habe einen Blog angefangen.\n  </p>\n\n  <p>\n    Ihr(TM) wisst sicherlich noch - damals - als ich 2008 diesen Security Blog hatte. Das war irgendwann durch (damals) Twitter nicht mehr notwendig, weil der Austausch sowieso schneller ging und irgendwann niemand mehr RSS-Reader hatte. Danke Google fürs Abschalten von Google Reader, du Arsch!\n  </p>\n\n  <p>\n    Da Twitter nun durch Mastodon ersetzt wurde, funktioniert das mit dem schnelleren Austausch immer noch ganz gut, aber da haben wir das 500 Zeichen Limit. Ordentliche Tutorials lassen sich damit nicht schreiben.\n  </p>\n\n    <h2 id=\"umgang-mit-technologie\">\n      Umgang mit Technologie\n    </h2>\n\n  <p>\n    Einige Jahre tat sich auch nichts Wildes im Bereich Technologie, sodass es sich für mich lohnte darüber zu schreiben. Aber nun habe ich wieder Zeit und Interesse mein Archiv zu pflegen. Einfach nur um das im Archiv zu haben und euch darauf zu stoßen.\n  </p>\n\n  <p>\n    Wir sind wieder an dem Punkt und deshalb bin ich wieder da.\n  </p>\n\n  <p>\n    Also füttert euren lokalen RSS-Reader (ich habe auch noch einen) mit der URL:&nbsp;<a href=\"https://www.1337core.de/blog/feed.xml\">https://www.1337core.de/blog/feed.xml</a>\n  </p>\n\n  <p>\n    \n  </p>",
            "author": {
                "name": "Leetcore"
            },
            "tags": [
            ],
            "date_published": "2025-07-18T08:17:19+02:00",
            "date_modified": "2026-02-12T09:22:05+01:00"
        }
    ]
}
